app/controllers/api/v1/home_controller.rb

SELECT "users".* FROM "users"
---
  def all
    user = User.all