app/controllers/api/v1/payment_details_controller.rb

UPDATE "payment_details" SET "card_number" = $1, "updated_at" = $2 WHERE "payment_details"."id" = $3  [["card_number", "654321"], ["updated_at", "2018-12-11 01:30:30.370932"], ["id", 2]]
---
  def update
    if @paydetail.update(payment_details_params)