app/controllers/api/v1/payment_details_controller.rb

  def index
    paydetail = PaymentDetail.all
---
SELECT "payment_details".* FROM "payment_details"

      def destroy
        @paydetail = PaymentDetail.find(params[:id])
---
SELECT  "payment_details".* FROM "payment_details" WHERE "payment_details"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
      @paydetail = PaymentDetail.new(params[:paydetail])
      if @paydetail.save
         redirect_to :action => 'list'
      else
         @paydetail = Subject.find(:all)
---
INSERT INTO "payment_details" ("card_number", "cvv", "isPaid", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["card_number", "123456"], ["cvv", "4576"], ["isPaid", false], ["created_at", "2018-12-11 01:22:15.853002"], ["updated_at", "2018-12-11 01:22:15.853002"]]
SELECT  "payment_details".* FROM "payment_details" WHERE "payment_details"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

   def update
     @paydetail = PaymentDetail.find(params[:id])

    if @paydetail.update(payment_detail_params)
---
SELECT  "payment_details".* FROM "payment_details" WHERE "payment_details"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "payment_details" SET "card_number" = $1, "cvv" = $2, "updated_at" = $3 WHERE "payment_details"."id" = $4  [["card_number", "111111111111111288888888888888"], ["cvv", "47623"], ["updated_at", "2018-12-12 07:04:45.549171"], ["id", 3]]

  def find_PaymentDetail
    @paydetail = PaymentDetail.find_by(id: params[:id])
---
SELECT  "payment_details".* FROM "payment_details" WHERE "payment_details"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]