app/controllers/api/v1/product_invests_controller.rb

SELECT "product_invests".* FROM "product_invests"
---
def index
	prodinvests = ProductInvest.all
	if prodinvests.present?

INSERT INTO "product_invests" ("price", "slot", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["price", 1800000.0], ["slot", 20], ["created_at", "2018-12-02 14:03:21.882034"], ["updated_at", "2018-12-02 14:03:21.882034"]]
---
def create
	prodinvest = ProductInvest.new(prodinvest_params)
	if prodinvest.save

UPDATE "product_invests" SET "price" = $1, "slot" = $2, "updated_at" = $3 WHERE "product_invests"."id" = $4  [["price", 56000000.0], ["slot", 20], ["updated_at", "2018-12-02 15:08:28.277602"], ["id", 3]]
---
	def update
		update_prodinvest = ProductInvest.update(prodinvest_params)

SELECT  "product_invests".* FROM "product_invests" WHERE "product_invests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def find_prodinvest
		@prodinvest = ProductInvest.find_by(id: params[:id])