app/controllers/api/v1/product_types_controller.rb

    def index
        product_type = ProductType.all
            if product_type.present?
---
SELECT "product_types".* FROM "product_types" ORDER BY created_at DESC
SELECT "product_types".* FROM "product_types"

    def show
        product_type = ProductType.find(params[:id])
---
SELECT  "product_types".* FROM "product_types" WHERE "product_types"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        product_type = ProductType.new(product_type_params)
        if product_type.save
---
INSERT INTO "product_types" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Sapi Gelap"], ["created_at", "2018-11-26 15:45:25.938376"], ["updated_at", "2018-11-26 15:45:25.938376"]]

    def destroy
        product_type = ProductType.find(params[:id])
            if product_type.destroy!
---
SELECT  "product_types".* FROM "product_types" WHERE "product_types"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "product_types" WHERE "product_types"."id" = $1  [["id", 3]]

    def update
        product_type = ProductType.find(params[:id])
            if product_type.update_attributes(product_type_params)
---
SELECT  "product_types".* FROM "product_types" WHERE "product_types"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "product_types" SET "name" = $1, "updated_at" = $2 WHERE "product_types"."id" = $3  [["name", "Sapi Gelap"], ["updated_at", "2018-11-26 15:41:55.563621"], ["id", 3]]