app/controllers/api/v1/product_invest_details_controller.rb

  def find_proinvdetail
    @proinvdetail = ProductInvestDetail.find_by(id: params[:id])
---
SELECT  "product_invest_details".* FROM "product_invest_details" WHERE "product_invest_details"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]