app/controllers/api/v1/product_invests_controller.rb

	def find_prodinvest
		@prodinvest = ProductInvest.find_by(id: params[:id])
---
SELECT  "product_invests".* FROM "product_invests" WHERE "product_invests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]