app/controllers/api/v1/products_controller.rb

SELECT "products".* FROM "products"
---
    def index
        product = Product.all
            if product.present?

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def show
        product = Product.find(params[:id])

INSERT INTO "products" ("name", "image", "province_id", "product_type_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "ayam"], ["image", "www.apaan.com"], ["province_id", 1], ["product_type_id", 1], ["created_at", "2018-11-26 17:58:36.207944"], ["updated_at", "2018-11-26 17:58:36.207944"]]
---
    def create
        product = Product.create(product_params)

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 1]]
---
    def destroy
        product = Product.find(params[:id])
            if product.destroy!

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def update
        product = Product.find(params[:id])