app/controllers/api/v1/provinces_controller.rb

SELECT  "provinces".* FROM "provinces" LIMIT $1  [["LIMIT", 11]]
SELECT "regionals".* FROM "regionals" WHERE "regionals"."province_id" = $1  [["province_id", 1]]
---
    def index
        @prov = Province.first
        @reg = Regional.first

SELECT "provinces".* FROM "provinces"
---
    def show
        @prov = Province.find(params[:id])
       # @prov = Province.all
        if @prov.present?