app/controllers/api/v1/provinces_controller.rb

    def index
        provinces = Province.all
            if provinces.present?
---
SELECT  "provinces".* FROM "provinces" ORDER BY "provinces"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "provinces".* FROM "provinces"

    def show
        province = Province.find(params[:id])
---
SELECT  "provinces".* FROM "provinces" WHERE "provinces"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        province = Province.new(province_params)
        if province.save
---
INSERT INTO "provinces" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Sumatra Utara"], ["created_at", "2018-11-26 15:49:20.066128"], ["updated_at", "2018-11-26 15:49:20.066128"]]

    def destroy
        province = Province.find(params[:id])
            if province.destroy!
---
SELECT  "provinces".* FROM "provinces" WHERE "provinces"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "provinces" WHERE "provinces"."id" = $1  [["id", 3]]

    def update
        province = Province.find(params[:id])
            if province.update_attributes(province_params)
---
SELECT  "provinces".* FROM "provinces" WHERE "provinces"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "provinces" SET "name" = $1, "updated_at" = $2 WHERE "provinces"."id" = $3  [["name", "Jawa Tengah"], ["updated_at", "2018-11-26 15:50:29.393427"], ["id", 2]]