app/controllers/api/v1/users_controller.rb

  def current
    if current_user
      current_user.update!(last_login: Time.zone.now)
---
UPDATE "users" SET "last_login" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["last_login", "2018-11-29 06:31:04.243707"], ["updated_at", "2018-11-29 06:31:04.250436"], ["id", 12]]

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("name", "email", "role", "created_at", "updated_at", "encrypted_password") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    user = User.find(params[:id])
    if user.present? && user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "laki"], ["updated_at", "2018-12-07 03:14:51.733335"], ["id", 6]]

  def destroy
    user = User.find(params[:id])
    if user.role == 'admin'
      user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 7]]